{
  "nodes": [
    {
      "op": "null", 
      "name": "input", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_nn_batch_flatten", 
      "attrs": {
        "hash": "8f6e7c36bb0c7e49", 
        "func_name": "tvmgen_default_fused_cast_nn_batch_flatten", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_add_sigmoid", 
      "attrs": {
        "hash": "3ebc9dc88d372e95", 
        "func_name": "tvmgen_default_fused_nn_dense_add_sigmoid", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_add_sigmoid_1", 
      "attrs": {
        "hash": "f959be4ab9cc3eac", 
        "func_name": "tvmgen_default_fused_nn_dense_add_sigmoid_1", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_add_tanh", 
      "attrs": {
        "hash": "cc8fb36068d41925", 
        "func_name": "tvmgen_default_fused_nn_dense_add_tanh", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [0, 2, 3, 5, 6, 8, 9], 
  "heads": [
    [
      10, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        9, 
        1
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 6], 
        [1, 6], 
        [256, 6], 
        [1, 256], 
        [1, 256], 
        [256, 256], 
        [1, 256], 
        [1, 256], 
        [4, 256], 
        [1, 4], 
        [1, 4]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11
  ]
}